{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 40, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "batch_input_shape": [null, 1]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 30}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 30, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 30}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 30, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 30}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 30, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 20}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}}]}